% 互信息法求时延
% 使用平台 - Matlab6.5 / Matlab7.0
% 作者：陆振波，海军工程大学
% 欢迎同行来信交流与合作，更多文章与程序下载请访问我的个人主页
% 电子邮件：luzhenbo@yahoo.com.cn
% 个人主页：http://luzhenbo.88uu.com.cn

clc
clear
close all

%----------------------------------------------------------------------%
% 产生混沌时间序列

sigma = 10;             % Lorenz 方程参数 a
b = 8/3;                %                 b
r = 34;                 %                 c            

y = [-1,0,1];           % 起始点 (1 x 3 的行向量)
h = 0.01;               % 积分时间步长

k1 = 6000;              % 前面的迭代点数
k2 = 3000;              % 后面的迭代点数

z = LorenzData(y,h,k1+k2,sigma,r,b);
z = z(k1+1:end,:);

%----------------------------------------------------------------------%
% 调用 mex 函数

X = z(:,1);             % 时间序列，列向量
maxLags = 100;          % 最大时延
Part = 128;             % 每一座标划分的份数
r = Mutual_Information(X,maxLags,Part);

%----------------------------------------------------------------------%
% 寻找第一个局部极小点

for i = 1:length(r)-1           
    if (r(i)<=r(i+1))
        tau = i;        % 第一个局部极小值位置
        break;
    end
end
optimal_tau = tau -1    % r 的第一个值对应 tau = 0,所以要减 1

%----------------------------------------------------------------------%
% 图形显示

plot(0:length(r)-1,r)
xlabel('Lag');
title('互信息法求时延');